app/Controllers/Berita.php

DELETE FROM `berita`
WHERE `id` IN ('13')
---
    public function delete($id)
    {
        $this->beritaModel->delete($id);