app/Controllers/User.php

INSERT INTO `user` (`username`, `name`, `password`, `created_at`, `updated_at`) VALUES ('zakiii', 'zaki', 'zaki1234', '2022-03-29 22:24:20', '2022-03-29 22:24:20')
---
            'password' => $this->request->getVar('password')
        );
        $model = new UserModel;
        $model->insert($data);

SELECT *
FROM `user`
WHERE `username` = 'zakiii'
 LIMIT 1
---
    public function auth()
    {
        $usersModel = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $usersModel->where('username', $username)->first();