app/Models/BeritaModel.php

SELECT *
FROM `berita`
SELECT *
FROM `berita`
WHERE `slug` = 'berita'
 LIMIT 1
---
    public function getBerita($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();

SELECT COUNT(*) AS `numrows`
FROM `berita`
---
    public function getCountBerita()
    {
        $builder = $this->db->table('berita');
        return $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function getcountUser()
    {
        $builder = $this->db->table('user');
        return $builder->countAllResults();